import warnings
warnings.filterwarnings("ignore")

from pytest import mark
from app.workflows.autogen_workflow import AutoGenWorkflow as Workflow

@mark.workflow
class WorkflowTests:
    def test_workflow_behaviours(self):
        request = """发票类型：专票
            客户名称：深圳标普云科技有限公司
            客户税号：91440300MA5EF4Q15E

            ##商品1
            商品名称：金属制品螺丝刀批头
            商品税编：1080404060000000000
            规格型号：B3-T20X100
            单位：个
            商品数量：25
            商品单价：8
            商品金额：200
            商品税率：13%

            ##商品2
            商品名称：金属制品套筒
            商品税编：1080404110000000000
            规格型号：3BMS1010
            单位：个
            商品数量：10
            商品单价：2.3
            商品金额：23
            商品税率：13%

            ##商品3
            商品名称：金属制品套筒
            商品税编：1080404110000000000
            规格型号：3BMS1015
            单位：个
            商品数量：2
            商品单价：5.4
            商品金额：10.8
            商品税率：13%

            ##商品4
            商品名称：金属制品套筒
            商品税编：1080404110000000000
            规格型号：3BMS1010
            单位：个
            商品数量：30
            商品单价：9
            商品金额：270
            商品税率：13%

            ##商品5
            商品名称：金属制品螺丝刀批头
            商品税编：1080404060000000000
            规格型号：B3-T20X100
            单位：个
            商品数量：125
            商品单价：3
            商品金额：375
            商品税率：13%

            ##商品6
            商品名称：机床动油压脉冲扳手
            商品税编：1090109000000000000
            规格型号：UL60D
            单位：把
            商品数量：1
            商品单价：205
            商品金额：205
            商品税率：13%

            ##商品7
            商品名称：试验检测机械数字式扭力测试扳手
            商品税编：1090606070000000000
            规格型号：CEM200N3X19D-G
            单位：把
            商品数量：2
            商品单价：75
            商品金额：150
            商品税率：13%

            ##商品8
            商品名称：金属制品螺丝刀批头
            商品税编：1080404060000000000
            规格型号：B3-T20X200
            单位：个
            商品数量：1
            商品单价：330
            商品金额：330
            商品税率：13%

            ##商品9
            商品名称：金属制品螺丝刀批头
            商品税编：1080404060000000000
            规格型号：B4-T20X33
            单位：个
            商品数量：2
            商品单价：101
            商品金额：202
            商品税率：13%"""
        context = """"""
        workflow_instance = Workflow(request, context)
        result = workflow_instance.actor()
        print("Result: ", result)
        assert result is not None